wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     biotConsolidationFoam;

startFrom       startTime;

startTime	0;

stopAt          endTime;

endTime         600;

deltaT          0.5;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

nonlinearity nonLinear;

wave standingWave;

//libs ( /*"libSoilFvPatchFields.so"*/ "libOpenFOAM.so" "libgroovyBC.so");


// ************************************************************************* //
