wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices        
(
    ( 0 0 0 ) //0
    ( 1 0 0 )//1
    ( 1 0 -20 )//2
    ( 0 0 -20 )//3
    ( 0 1 0 ) //4
    ( 1 1 0 )//5
    ( 1 1 -20 )//6
    ( 0 1 -20 )//7    
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (4 200 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch top
    (
        (0 4 5 1)
    )
    patch frontAndBack
    (
        (0 1 2 3)
        (4 5 6 7)
    )
     patch bottom
    (
        (3 7 6 2)
    )
     patch leftAndRight
    (
        (0 4 7 3)
        (1 5 6 2)
    )
 );

mergePatchPairs
(
);

// ************************************************************************* //
