wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/constant/soilProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      materialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  rhoMixture             rhoMixture [1 -3 0 0 0 0 0] 2155;

  Ex             1.0e8;
  Ey             1.0e8;
  Ez             1.0e8;
  nuxy           0.25;
  nuyz           0.25;
  nuzx           0.25;

  Gxy           0.4e8;  
  Gyz           0.4e8;
  Gzx           0.4e8; // para1

kx               kx [ 0 1 -1 0 0 0 0 ] 0.00001;
ky               ky [ 0 1 -1 0 0 0 0 ] 0.00001; //permeability
kz               kz [ 0 1 -1 0 0 0 0 ] 0.00001;



K               K [ 1 -1 -2 0 0 0 0 ] 1.95e9; //Bulk modulus of water

Sr           	Sr [ 0 0 0 0 0 0 0 ] 0.995;

p0           	p0 [ 1 -1 -2 0 0 0 0 ] 5e5;

//gamma_w           gamma_w [ 1 -2 -2 0 0 0 0 ] 1e4;
//gamma_s           gamma_s [ 1 -2 -2 0 0 0 0 ] 2.65e4;
rho_w		rho_w [1 -3 0 0 0 0 0 ] 1e3;
rho_s		rho_s [1 -3 0 0 0 0 0 ] 2.65e3;

K0          K0 [ 0 0 0 0 0 0 0 ] 0.5;

n           	n [ 0 0 0 0 0 0 0 ] 0.3;

planeStress     no;

model2D        no;
wave Wave;
// ************************************************************************* //
