wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "30.5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            timeVaryingMappedTotalTraction;
	value		uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    
    bottom
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
