wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "30.5";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
	type            fixedValue;
        value 		uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    
    bottom
    {
        type            zeroGradient;
    }
    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
