wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/0/sigma_S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "30.5";
    object      sigma_S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    top
    {
	type            timeVaryingMappedFixedValue;
        setAverage 	off;
    }
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            zeroGradient;
    }
    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
