wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default     steadyState;
}

ddtSchemes
{
    default 	    Euler;
}

gradSchemes
{
    default         extendedLeastSquares 0;
    grad(U)         extendedLeastSquares 0;
    grad(p)         extendedLeastSquares 0;
}

divSchemes
{
    default         Gauss linear corrected;
    div(sigmaD)     Gauss linear;
    div(ddt(Dp2,U)) Gauss linear corrected;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(U) Gauss linear corrected;
    laplacian(Dp,p) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         none;
}

fluxRequired
{
    default         no;
    U               yes;
    p               no;
}


// ************************************************************************* //
