wssi-fe-3.1/tutorials/consolidation/1DTerzaghi/system/sampleDict(porepressure)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

surfaceFormat foamFile;

sets
(
 	pressure
	{
	  type uniform;
	  axis z;
          start   (0 0.5 0); 
          end     (0 0.5 -20); 
          nPoints 100;         
       }  

);

surfaces (

);
fields          ( p ); // U;


// ************************************************************************* //
